Repository: fanabyte/fanabyte-certificate
Catalog: languages/fanabyte-certificate-*.po
Languages: fa_ir

source: Field Type:
fa_ir: نوع فیلد:

source: Key Name:
fa_ir: نام کلیدی (Key):

source: Field Label:
fa_ir: عنوان فیلد:

source: Key field for search?
fa_ir: فیلد کلیدی برای جستجو؟

source: Drag to reorder
fa_ir: جابجا کنید

source: Delete
fa_ir: حذف

source: Are you sure you want to delete this field?
fa_ir: آیا از حذف این فیلد مطمئن هستید؟

source: Select or Upload
fa_ir: انتخاب یا آپلود

source: Use this file
fa_ir: استفاده از این فایل

source: Current file:
fa_ir: فایل فعلی:

source: Copied!
fa_ir: کپی شد!

source: Error copying code!
fa_ir: خطا در کپی کردن کد!

source: QR Code
fa_ir: کد QR

source: Certificate Information & Details
fa_ir: اطلاعات و جزئیات مدرک

source: Main Certificate File (PDF/Image)
fa_ir: فایل اصلی مدرک (PDF/Image)

source: Personal Photo (Optional)
fa_ir: تصویر پرسنلی (اختیاری)

source: Custom Fields
fa_ir: فیلدهای سفارشی

source: Untitled
fa_ir: بدون عنوان

source: Select/Upload Image
fa_ir: انتخاب/آپلود تصویر

source: Remove
fa_ir: حذف

source: To add information, first define the desired fields on the %s page.
fa_ir: برای افزودن اطلاعات، ابتدا فیلدهای مورد نظر را در صفحه %s تعریف کنید.

source: Certificates -> Settings -> Field Management
fa_ir: استعلام مدرک -> تنظیمات -> مدیریت فیلدها

source: Select Image:
fa_ir: انتخاب تصویر:

source: Select a square image to display next to the title (allowed formats: jpg, jpeg, png).
fa_ir: یک تصویر مربعی برای نمایش در کنار عنوان انتخاب کنید (فرمت‌های مجاز: jpg, jpeg, png).

source: Custom Footer Text (Optional)
fa_ir: متن دلخواه پایین صفحه (اختیاری)

source: Enter text:
fa_ir: متن مورد نظر:

source: This text will be displayed at the bottom of the page (in the footer section, right side).
fa_ir: این متن در پایین صفحه (در بخش فوتر، سمت راست) نمایش داده خواهد شد.

source: Select/Upload File
fa_ir: انتخاب/آپلود فایل

source: The main PDF or image file of the certificate.
fa_ir: فایل PDF یا تصویر اصلی مدرک.

source: FanaByte Certificates
fa_ir: مدرک‌های فنابایت

source: Certificate Inquiry
fa_ir: استعلام مدرک

source: Certificate Inquiry Settings
fa_ir: تنظیمات استعلام مدرک

source: Settings
fa_ir: تنظیمات

source: Plugin Usage Guide
fa_ir: راهنمای استفاده از افزونه

source: Usage Guide
fa_ir: راهنمای استفاده

source: About the Plugin
fa_ir: درباره افزونه

source: About Us
fa_ir: درباره ما

source: Plugin Language
fa_ir: زبان افزونه

source: Field Management
fa_ir: مدیریت فیلدها

source: Form/URL/Buttons Settings
fa_ir: تنظیمات فرم/URL/دکمه‌ها

source: Import/Export
fa_ir: واردات/صادرات

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Export Settings
fa_ir: خروجی گرفتن از تنظیمات

source: Click the button below to export the current plugin settings (fields and form/URL/button settings) as a JSON file.
fa_ir: برای گرفتن خروجی از تنظیمات فعلی افزونه (فیلدها و تنظیمات فرم/URL/دکمه‌ها) به عنوان یک فایل JSON روی دکمه زیر کلیک کنید.

source: Download Export File (JSON)
fa_ir: دریافت فایل خروجی (JSON)

source: Import Settings
fa_ir: وارد کردن تنظیمات

source: Select the JSON settings file you previously exported and upload it here. Note: This will overwrite your current settings.
fa_ir: فایل تنظیمات (با فرمت JSON) که قبلا خروجی گرفته‌اید را انتخاب و بارگذاری کنید. توجه: تنظیمات فعلی بازنویسی خواهند شد.

source: Select JSON file:
fa_ir: انتخاب فایل JSON:

source: Upload and Import Settings
fa_ir: بارگذاری و درون‌ریزی تنظیمات

source: About the Plugin and FanaByte Academy
fa_ir: درباره افزونه و آکادمی فنابایت

source: This plugin was designed and developed by FanaByte Academy.
fa_ir: این افزونه توسط آکادمی فنابایت طراحی و توسعه داده شده است.

source: FanaByte Academy Logo
fa_ir: لوگو آکادمی فنابایت

source: The FanaByte Story
fa_ir: داستان فنابایت

source: We started in 1400 (Persian calendar), or more accurately, since 1390. In the beginning, we didn't have an official website. FanaByte's goal is to help everyone build a successful online business.
fa_ir: از سال 1400 شروع به‌کار کردیم البته دقیق‌تر از سال 1390 اون اوایل وبسایت رسمی نداشتیم، هدف فنابایت کمک به همه افراد برای ساخت یک کسب‌و‌کار اینترنتی موفق است.

source: But how? At FanaByte, we teach you how to set up and use the world's best website builder, which powers over 40% of the world's websites.
fa_ir: اما چطور؟ ما در فنابایت نحوه راه اندازی و استفاده از بهترین سایت‌ساز دنیا را که بیش از 40% o درصد وب‌سایت های دنیا از آن استفاده می‌کنند را به شما می‌آموزیم.

source: We have also published many free articles and video tutorials, as well as several training packages in various fields, which you can use to increase your knowledge and develop your business.
fa_ir: هم‌چنین کلی مقاله و ویدئو های آموزشی رایگان و یکسری پکیج های آموزشی در حوزه های مختلف منتشر کرده‌ایم، که میتوانید از آنها در جهت افزایش علم و توسعه کسب و کار خود استفاده کنید.

source: Follow Us!
fa_ir: ما را دنبال کنید!

source: Please follow us on social media:
fa_ir: لطفا ما را در شبکه‌های اجتماعی دنبال کنید:

source: FanaByte YouTube
fa_ir: یوتیوب فنابایت

source: FanaByte Instagram
fa_ir: اینستاگرام فنابایت

source: FanaByte Threads
fa_ir: تردز فنابایت

source: FanaByte Facebook
fa_ir: فیسبوک فنابایت

source: FanaByte GitHub
fa_ir: گیت‌هاب فنابایت

source: FanaByte LinkedIn
fa_ir: لینکدین فنابایت

source: FanaByte X (Twitter)
fa_ir: ایکس (توییتر) فنابایت

source: FanaByte Telegram
fa_ir: تلگرام فنابایت

source: FanaByte Pinterest
fa_ir: پینترست فنابایت

source: FanaByte Email
fa_ir: ایمیل فنابایت

source: If you enjoy this plugin and find it useful, please consider supporting its development by buying us a coffee. Your support is greatly appreciated!
fa_ir: اگر از این افزونه لذت می‌برید و برای شما مفید است، لطفاً با خرید یک قهوه از توسعه آن حمایت کنید. حمایت شما برای ما بسیار ارزشمند است!

source: Support FanaByte on Coffeete
fa_ir: حمایت از فنابایت در کافیته

source: Visit FanaByte Academy Website
fa_ir: مشاهده وب‌سایت آکادمی فنابایت

source: Error: Image path not found (%s).
fa_ir: خطا: مسیر تصاویر یافت نشد (%s).

source: Certificate Fields
fa_ir: فیلدهای مدرک

source: Defined Fields
fa_ir: فیلدهای تعریف شده

source: 1. Inquiry Form Customization
fa_ir: 1. شخصی‌سازی فرم استعلام

source: Text Above Inquiry Form
fa_ir: متن بالای فرم استعلام

source: Search Button Text
fa_ir: متن دکمه جستجو

source: Search Button Color
fa_ir: رنگ دکمه جستجو

source: Field Placeholders
fa_ir: متن نگهدارنده فیلدها

source: 2. Certificate URL Settings
fa_ir: 2. تنظیمات URL مدرک

source: Base URL Slug
fa_ir: اسلاگ پایه URL

source: 3. Download Button Customization
fa_ir: 3. شخصی‌سازی دکمه دانلود

source: Download Button Text
fa_ir: متن و رنگ دکمه دانلود:

source: Download Button Color
fa_ir: رنگ دکمه دانلود

source: 4. Labels and Titles Settings
fa_ir: 4. تنظیمات برچسب‌ها و عناوین

source: Details Section Heading
fa_ir: عنوان بخش جزئیات

source: Info Metabox Title
fa_ir: عنوان متاباکس اطلاعات

source: Personal Photo Field Label
fa_ir: برچسب فیلد عکس پرسنلی

source: Main File Metabox Title
fa_ir: عنوان متاباکس فایل اصلی

source: Select Language
fa_ir: انتخاب زبان

source: In this section, you can define the fields you want to enter for each certificate. You can specify the display order of the fields by dragging the move icon <span class="dashicons dashicons-move"></span>. You can select up to two text fields as "key fields" for searching.
fa_ir: در این بخش می‌توانید فیلدهایی که می‌خواهید برای هر مدرک وارد کنید را تعریف نمایید. با کشیدن <span class="dashicons dashicons-move"></span> می‌توانید ترتیب نمایش فیلدها را مشخص کنید. حداکثر دو فیلد متنی را می‌توانید به عنوان "فیلد کلیدی" برای جستجو انتخاب کنید.

source: Image
fa_ir: تصویر

source: Text
fa_ir: متنی

source: Delete this field
fa_ir: حذف این فیلد

source: No fields have been defined yet. Add a new field using the section below.
fa_ir: هنوز هیچ فیلدی تعریف نشده است. از بخش زیر یک فیلد جدید اضافه کنید.

source: Add New Field
fa_ir: افزودن فیلد جدید

source: Add Field
fa_ir: افزودن فیلد

source: After adding, you can change the field order by dragging and dropping.
fa_ir: پس از افزودن، می‌توانید ترتیب فیلدها را با کشیدن و رها کردن تغییر دهید.

source: You cannot select more than 2 key fields. Only the first 2 in the order were saved as keys.
fa_ir: شما نمی‌توانید بیش از 2 فیلد کلیدی انتخاب کنید. فقط 2 تای اول در ترتیب به عنوان کلیدی ذخیره شدند.

source: Settings for the text and button of the inquiry form.
fa_ir: تنظیمات متن و دکمه فرم استعلام.

source: This text will be displayed before the search form. You can use all the features of the WordPress editor.
fa_ir: این متن قبل از فرم جستجو نمایش داده می‌شود. می‌توانید از تمام امکانات ویرایشگر وردپرس استفاده کنید.

source: Search
fa_ir: جستجو

source: Background color for the search button.
fa_ir: رنگ پس‌زمینه دکمه جستجو.

source: First, select at least one field as a "key field" in the "Field Management" tab.
fa_ir: ابتدا حداقل یک فیلد را به عنوان "فیلد کلیدی" در تب "مدیریت فیلدها" انتخاب کنید.

source: Placeholder text (hint) displayed inside each search field:
fa_ir: متن نگهدارنده (راهنما) که داخل هر فیلد جستجو نمایش داده می‌شود:

source: Please enter %s
fa_ir: لطفا %s را وارد کنید

source: In this section, you can set the fixed part of the certificate URLs (slug).
fa_ir: در این بخش می‌توانید بخش ثابت URL مدرک‌ها (اسلاگ) را تنظیم کنید.

source: Important:
fa_ir: مهم:

source: After changing and saving this value, you must visit the Settings > %s page in the WordPress admin and click the "Save Changes" button (even without changing anything there). This is necessary to apply the new URL structure.
fa_ir: پس از تغییر و ذخیره این مقدار، حتما به صفحه تنظیمات > %s در پیشخوان وردپرس مراجعه کرده و دکمه "ذخیره تغییرات" را بزنید (حتی بدون تغییر چیزی در آن صفحه). این کار برای اعمال ساختار URL جدید ضروری است.

source: Permalinks
fa_ir: پیوندهای یکتا

source: Use only lowercase English letters, numbers, and hyphens (-).
fa_ir: فقط از حروف کوچک انگلیسی، اعداد و خط تیره (-) استفاده کنید.

source: Current certificate URL structure: %s
fa_ir: ساختار فعلی URL مدرک‌ها: %s

source: Settings for the text and color of the "Download Certificate File" button displayed on the details page.
fa_ir: تنظیمات متن و رنگ دکمه "دانلود فایل مدرک" که در صفحه جزئیات نمایش داده می‌شود.

source: Download Certificate File
fa_ir: دانلود فایل مدرک

source: Background color for the download button.
fa_ir: رنگ پس‌زمینه دکمه دانلود.

source: Change the default text for some parts of the plugin here.
fa_ir: متن‌های پیش‌فرض برخی از بخش‌های افزونه را در اینجا تغییر دهید.

source: Certificate Details:
fa_ir: جزئیات مدرک:

source: The heading displayed above the custom fields list on the certificate view page.
fa_ir: عنوانی که بالای لیست فیلدهای سفارشی در صفحه نمایش مدرک نشان داده می‌شود.

source: Title for the main metabox on the certificate edit/add screen.
fa_ir: عنوان متاباکس آپلود فایل اصلی در صفحه ویرایش/افزودن مدرک.

source: Label for the personal photo upload field on the certificate edit/add screen.
fa_ir: برچسب فیلد آپلود عکس پرسنلی در صفحه ویرایش/افزودن مدرک.

source: Title for the main file upload metabox on the certificate edit/add screen.
fa_ir: عنوان متاباکس آپلود فایل اصلی در صفحه ویرایش/افزودن مدرک.

source: Security check failed!
fa_ir: خطای امنیتی!

source: Security Error
fa_ir: خطای امنیتی

source: You do not have permission to perform this action.
fa_ir: شما اجازه انجام این کار را ندارید.

source: Permission Denied
fa_ir: عدم دسترسی

source: Settings imported and saved successfully.
fa_ir: تنظیمات با موفقیت وارد و ذخیره شدند.

source: If the URL slug was changed, please visit the Settings > Permalinks page and click Save Changes.
fa_ir: اگر اسلاگ URL تغییر کرده است، لطفاً به صفحه تنظیمات > پیوندهای یکتا مراجعه و دکمه ذخیره را بزنید.

source: File size exceeds the limit allowed by php.ini.
fa_ir: حجم فایل بیشتر از حد مجاز php.ini است.

source: File size exceeds the limit allowed by the form.
fa_ir: حجم فایل بیشتر از حد مجاز فرم است.

source: The file was only partially uploaded.
fa_ir: فایل ناقص آپلود شد.

source: No file was selected for upload.
fa_ir: فایلی انتخاب نشده بود.

source: Missing temporary folder.
fa_ir: پوشه موقت یافت نشد.

source: Failed to write file to disk.
fa_ir: خطا در نوشتن فایل.

source: File upload stopped by a PHP extension.
fa_ir: آپلود توسط افزونه PHP متوقف شد.

source: No file found.
fa_ir: فایلی یافت نشد.

source: Unknown upload error.
fa_ir: خطای نامشخص آپلود.

source: Error uploading file:
fa_ir: خطا در آپلود فایل:

source: Invalid file format. Please upload a .json file only.
fa_ir: فرمت فایل نامعتبر است. لطفاً فقط فایل .json آپلود کنید.

source: Error reading file content.
fa_ir: خطا در خواندن محتوای فایل.

source: Maximum stack depth exceeded.
fa_ir: حداکثر عمق پشته.

source: Invalid or malformed JSON.
fa_ir: JSON نامعتبر/ناقص.

source: Control character error, possibly incorrectly encoded.
fa_ir: کاراکتر کنترلی نامعتبر.

source: Syntax error.
fa_ir: خطای نحوی (سینتکس کد).

source: Malformed UTF-8 characters, possibly incorrectly encoded.
fa_ir: کاراکتر UTF-8 نامعتبر.

source: Recursive references detected.
fa_ir: ارجاع بازگشتی.

source: NAN or INF value encountered.
fa_ir: مقدار NAN یا INF.

source: A value of an unsupported type was found.
fa_ir: نوع داده غیرقابل انکود.

source: An invalid property name was found.
fa_ir: نام خصوصیت نامعتبر.

source: Malformed UTF-16 characters, possibly incorrectly encoded.
fa_ir: کاراکتر UTF-16 نامعتبر.

source: Unknown JSON error.
fa_ir: خطای ناشناخته JSON.

source: Invalid JSON file:
fa_ir: فایل JSON نامعتبر است:

source: Invalid JSON data structure.
fa_ir: ساختار داده JSON نامعتبر است.

source: FanaByte Certificate Inquiry Plugin Usage Guide
fa_ir: راهنمای استفاده از افزونه استعلام مدرک فنابایت

source: Welcome to the FanaByte Certificate plugin guide! This guide explains the steps to use the various features of the plugin.
fa_ir: به راهنمای افزونه استعلام مدرک فنابایت خوش آمدید! در این راهنما، مراحل استفاده از امکانات مختلف افزونه شرح داده شده است.

source: Initial Important Note:
fa_ir: نکته مهم اولیه:

source: After activating the plugin or anytime you change the "Base URL Slug" in the settings, it is recommended to visit the %1$s page once and click the "Save Changes" button to ensure the certificate links work correctly.
fa_ir: پس از فعال‌سازی افزونه یا هر زمان که "اسلاگ پایه URL" را در تنظیمات تغییر دادید، توصیه می‌شود یک بار به صفحه %1$s مراجعه و روی دکمه "ذخیره تغییرات" کلیک کنید تا مطمئن شوید لینک مدرک‌ها به درستی کار می‌کند.

source: Settings > Permalinks
fa_ir: تنظیمات > پیوندهای یکتا

source: 1. Initial Setup: Field Management
fa_ir: 1. تنظیمات اولیه: مدیریت فیلدها

source: The first step after installation and activation is to define the fields you want to have for each certificate.
fa_ir: اولین قدم پس از نصب و فعال‌سازی، تعریف فیلدهایی است که می‌خواهید برای هر مدرک داشته باشید.

source: From the admin menu, go to %s.
fa_ir: از منوی پیشخوان به %s بروید.

source: Certificates -> Settings
fa_ir: استعلام مدرک -> تنظیمات

source: Make sure you are on the "Field Management" tab.
fa_ir: مطمئن شوید در تب "مدیریت فیلدها" هستید.

source: In the "Add New Field" section: Select the field type (Text or Image) and click the "Add Field" button.
fa_ir: در بخش "افزودن فیلد جدید": نوع فیلد (متنی یا تصویر) را انتخاب و روی دکمه "افزودن فیلد" کلیک کنید.

source: The new field will be added to the list above. Enter an appropriate "Field Label" (e.g., Student Name, National ID, Course Name).
fa_ir: فیلد جدید به لیست بالا اضافه می‌شود. "عنوان فیلد" مناسب را وارد کنید (مثلاً: نام دانشجو، کد ملی، نام دوره).

source: The "Key Name" is generated automatically and is used to identify the field in the system.
fa_ir: "نام کلیدی (Key)" به صورت خودکار ایجاد می‌شود و برای شناسایی فیلد در سیستم استفاده می‌شود.

source: Key field for search?: Check this option if you want users to be able to query using this field (maximum 2 text fields).
fa_ir: فیلد کلیدی برای جستجو؟: اگر می‌خواهید کاربران با این فیلد بتوانند استعلام کنند، این گزینه را تیک بزنید (حداکثر 2 فیلد متنی).

source: To change the display order of the fields, drag and drop the move icon (%s) next to each field.
fa_ir: برای تغییر ترتیب نمایش فیلدها، آیکون (%s) کنار هر فیلد را کشیده و رها کنید.

source: To delete a field, click the %s button.
fa_ir: برای حذف فیلد، روی دکمه %s کلیک کنید.

source: After finishing, click the %s button.
fa_ir: پس از اتمام، روی دکمه %s کلیک کنید.

source: 2. Form, URL, and Button Settings
fa_ir: 2. تنظیمات فرم، URL و دکمه‌ها

source: In this section, you can customize the appearance and functionality of the search form, links, and related buttons.
fa_ir: در این بخش می‌توانید ظاهر و عملکرد فرم جستجو، لینک‌ها و دکمه‌های مرتبط را سفارشی کنید.

source: Go to the "Form/URL/Buttons Settings" tab.
fa_ir: به تب "تنظیمات فرم/URL/دکمه‌ها" بروید.

source: Inquiry Form Customization:
fa_ir: شخصی‌سازی فرم استعلام:

source: Text Above Form:
fa_ir: متن بالای فرم:

source: Using the full WordPress editor, add help text, images, or any other content before the search form.
fa_ir: با ویرایشگر کامل وردپرس، متن راهنما، تصویر یا هر محتوای دیگری را قبل از فرم جستجو قرار دهید.

source: Search Button Text & Color:
fa_ir: متن و رنگ دکمه جستجو:

source: Set the text and background color of the main form button.
fa_ir: متن و رنگ پس‌زمینه دکمه اصلی فرم را تنظیم کنید.

source: Placeholders:
fa_ir: متن نگهدارنده:

source: Specify the hint text inside the search fields (key fields).
fa_ir: متن راهنمای داخل فیلدهای جستجو (فیلدهای کلیدی) را مشخص کنید.

source: Certificate URL Settings:
fa_ir: تنظیمات URL مدرک:

source: Base URL Slug:
fa_ir: اسلاگ پایه URL:

source: Determine the fixed part of the URL (e.g., `certificate`). Only lowercase letters, numbers, and hyphens are allowed. After changing, be sure to go to %s and save.
fa_ir: بخش ثابت URL را تعیین کنید (مثلاً certificate). فقط حروف کوچک، اعداد و خط تیره مجاز است. پس از تغییر، حتماً به %s رفته و ذخیره کنید.

source: Download Button Customization:
fa_ir: شخصی‌سازی دکمه دانلود:

source: Download Button Text & Color:
fa_ir: متن و رنگ دکمه دانلود:

source: Set the text and background color of the "Download Certificate File" button that appears on the details page.
fa_ir: متن و رنگ پس‌زمینه دکمه "دانلود فایل مدرک" که در صفحه جزئیات ظاهر می‌شود را تنظیم کنید.

source: Labels and Titles Settings:
fa_ir: تنظیمات برچسب‌ها و عناوین:

source: Customize various default labels like the "Details Section Heading" or metabox titles used in the admin area and frontend.
fa_ir: برچسب‌های پیش‌فرض مختلف مانند "عنوان بخش جزئیات" یا عناوین متاباکس استفاده شده در بخش مدیریت و فرانت‌اند را سفارشی کنید.

source: Finally, click the %s button.
fa_ir: در انتها روی دکمه %s کلیک کنید.

source: 3. Adding and Managing Certificates
fa_ir: 3. افزودن و مدیریت مدرک‌ها

source: Follow these steps to register user certificates:
fa_ir: برای ثبت مدرک‌های کاربران مراحل زیر را دنبال کنید:

source: Certificates -> Add New
fa_ir: استعلام مدرک -> افزودن جدید

source: Enter the certificate title (e.g., Course X Certificate - Student Name).
fa_ir: عنوان مدرک را وارد کنید (مثلاً: مدرک دوره X - نام دانشجو).

source: In the "%s" section, enter the values for the custom fields you defined for this specific certificate.
fa_ir: در بخش "%s"، مقادیر مربوط به فیلدهای سفارشی که تعریف کرده‌اید را برای این مدرک خاص وارد کنید.

source: In the sidebar, in the "%s" metabox, upload the final certificate PDF or image file (optional).
fa_ir: در سایدبار، در متاباکس "%s"، فایل PDF یا تصویر نهایی مدرک را آپلود کنید (اختیاری).

source: You can use the main editor for additional descriptions or to display specific content on the certificate page (optional).
fa_ir: می‌توانید از ویرایشگر اصلی برای توضیحات بیشتر یا نمایش محتوای خاصی در صفحه مدرک استفاده کنید (اختیاری).

source: If needed, edit the %s (Slug) in the corresponding metabox.
fa_ir: در صورت نیاز، %s (Slug) را در متاباکس مربوطه ویرایش کنید.

source: Permalink
fa_ir: پیوند یکتا

source: Click the %s button.
fa_ir: روی دکمه %s کلیک کنید.

source: Publish
fa_ir: انتشار

source: To manage all certificates, go to the %s menu.
fa_ir: برای مدیریت همه مدرک‌ها، به منوی %s مراجعه کنید.

source: Certificates -> All Certificates
fa_ir: استعلام مدرک -> همه مدرک‌ها

source: 4. Displaying the Inquiry Form on Your Site
fa_ir: 4. نمایش فرم استعلام در سایت

source: To enable the inquiry feature for users:
fa_ir: برای فعال کردن قابلیت استعلام برای کاربران:

source: Go to edit an existing page or post, or create a new page (e.g., titled "Certificate Inquiry").
fa_ir: به بخش ویرایش یک برگه یا نوشته موجود بروید یا یک برگه جدید (مثلاً با عنوان "استعلام مدرک") ایجاد کنید.

source: In the content editor, place the following shortcode where you want the form to appear:
fa_ir: در ویرایشگر محتوا، شورت‌کد زیر را در محل دلخواه قرار دهید:

source: Click to copy
fa_ir: برای کپی کلیک کنید

source: Copy Code
fa_ir: کپی کد

source: Publish or update the page/post.
fa_ir: برگه/نوشته را منتشر یا به‌روزرسانی کنید.

source: Now, users visiting this page can search for their certificate by entering the key field information.
fa_ir: اکنون کاربران با مراجعه به این برگه می‌توانند با وارد کردن اطلاعات فیلدهای کلیدی، مدرک خود را جستجو کنند.

source: 5. Direct Certificate View and QR Code
fa_ir: 5. مشاهده مستقیم مدرک و کد QR

source: Each published certificate has a direct link and a QR code:
fa_ir: هر مدرک منتشر شده، یک لینک مستقیم و یک کد QR دارد:

source: Direct Link:
fa_ir: لینک مستقیم:

source: The unique URL for each certificate, which you can get from the edit screen or the certificate list. Its structure is based on the "Base URL Slug" set in step 2 and the certificate's own slug.
fa_ir: آدرس URL منحصر به فرد هر مدرک که می‌توانید آن را از صفحه ویرایش یا لیست مدرک‌ها دریافت کنید. ساختار کلی آن بر اساس "اسلاگ پایه URL" تنظیم شده در مرحله 2 و اسلاگ خود مدرک است.

source: QR Code:
fa_ir: کد QR:

source: An image code containing the direct link to the certificate. This code is displayed in the corresponding column in the "All Certificates" list and also on the certificate details page on the site. Suitable for printing or quick sharing.
fa_ir: یک کد تصویری که حاوی لینک مستقیم مدرک است. این کد در ستون مربوطه در لیست "همه مدرک‌ها" و همچنین در صفحه جزئیات مدرک در سایت نمایش داده می‌شود. مناسب برای چاپ یا اشتراک‌گذاری سریع.

source: 6. Importing and Exporting Settings
fa_ir: 6. ردات و صادرات تنظیمات

source: To back up or transfer plugin settings:
fa_ir: برای پشتیبان‌گیری یا انتقال تنظیمات افزونه:

source: Go to %1$s and select the %2$s tab.
fa_ir: به %1$s رفته و تب %2$s را انتخاب کنید.

source: Exporting:
fa_ir: خروجی گرفتن:

source: Click the "%s" button to download a file containing all settings.
fa_ir: روی دکمه "%s" کلیک کنید تا یک فایل حاوی تمام تنظیمات دانلود شود.

source: Importing:
fa_ir: وارد کردن:

source: Select the JSON settings file and click the "%s" button. Current settings will be overwritten.
fa_ir: فایل JSON تنظیمات را انتخاب و روی دکمه "%s" کلیک کنید. تنظیمات فعلی بازنویسی خواهند شد.

source: Note: After importing, you might need to visit the %s page and click Save Changes once.
fa_ir: توجه: پس از وارد کردن، ممکن است لازم باشد به صفحه %s مراجعه و یک بار دکمه ذخیره را بزنید.

source: 7. Troubleshooting
fa_ir: 7 عیب‌یابی

source: 404 Error (Page Not Found):
fa_ir: خطای 404 (صفحه یافت نشد):

source: Usually resolved by visiting %s and clicking "Save Changes".
fa_ir: معمولاً با مراجعه به %s و کلیک روی "ذخیره تغییرات" حل می‌شود.

source: Incorrect Styles Display:
fa_ir: عدم نمایش صحیح استایل‌ها:

source: Clear your browser and site cache.
fa_ir: کش مرورگر و سایت خود را پاک کنید.

source: Other Issues:
fa_ir: مشکلات دیگر:

source: For further assistance or to report an issue, please refer to the "%s" page in the plugin menu.
fa_ir: برای راهنمایی بیشتر یا گزارش مشکل، لطفاً به صفحه "%s" در منوی افزونه مراجعه کنید.

source: Select the language and direction for the plugin interface.
fa_ir: زبان و جهت افزونه را انتخاب کنید.

source: Persian (RTL)
fa_ir: فارسی (راست به چپ)

source: English (LTR)
fa_ir: انگلیسی (چپ به راست)

# Post type general name
source: Certificates
fa_ir: مدرک‌ها
