Repository: fanabyte/fanabyte-certificate
Catalog: languages/fanabyte-certificate-*.po
Languages: fa_ir

# Post type singular name
source: Certificate
fa_ir: مدرک

# Admin Menu text
source: Certificates
fa_ir: مدرک‌ها

# Add New on Toolbar
source: Certificate
fa_ir: مدرک

source: Add New
fa_ir: افزودن جدید

source: Add New Certificate
fa_ir: افزودن مدرک جدید

source: New Certificate
fa_ir: مدرک جدید

source: Edit Certificate
fa_ir: ویرایش مدرک

source: View Certificate
fa_ir: مشاهده مدرک

source: View Certificates
fa_ir: مشاهده مدرک‌ها

source: All Certificates
fa_ir: همه مدرک‌ها

source: Search Certificates
fa_ir: جستجوی مدرک‌ها

source: Parent Certificate:
fa_ir: والد مدرک:

source: No certificates found.
fa_ir: هیچ مدرکی یافت نشد.

source: No certificates found in Trash.
fa_ir: هیچ مدرکی در زباله‌دان یافت نشد.

# Overrides the "Featured Image" phrase.
source: Certificate Featured Image
fa_ir: تصویر شاخص مدرک

# Overrides the "Set featured image" phrase.
source: Set featured image
fa_ir: تنظیم تصویر شاخص

# Overrides the "Remove featured image" phrase.
source: Remove featured image
fa_ir: حذف تصویر شاخص

# Overrides the "Use as featured image" phrase.
source: Use as featured image
fa_ir: استفاده به عنوان تصویر شاخص

# The post type archive label.
source: Certificate Archives
fa_ir: بایگانی مدرک‌ها

# Overrides the "Insert into post/page" phrase.
source: Insert into certificate
fa_ir: افزودن به مدرک

# Overrides the "Uploaded to this post/page" phrase.
source: Uploaded to this certificate
fa_ir: آپلود شده در این مدرک

# Screen reader text for the filter links.
source: Filter certificates list
fa_ir: فیلتر لیست مدرک‌ها

# Screen reader text for the pagination heading.
source: Certificates list navigation
fa_ir: پیمایش لیست مدرک‌ها

# Screen reader text for the items list heading.
source: Certificates list
fa_ir: لیست مدرک‌ها

source: The requested certificate was not found or is invalid.
fa_ir: مدرک درخواستی یافت نشد یا معتبر نیست.

source: The inquiry form is unavailable because no key fields have been defined in the plugin settings.
fa_ir: فرم استعلام در دسترس نیست زیرا هیچ فیلد کلیدی در تنظیمات افزونه تعریف نشده است.

source: Certificate Details: %s
fa_ir: جزئیات مدرک: %s

source: New Search
fa_ir: جستجوی جدید

source: %d certificate found. Please select one to view:
fa_ir: %d مدرک یافت شد. لطفاً یکی را برای مشاهده انتخاب کنید:

source: Sorry, no certificate matching the provided details was found. Please check your input and try again.
fa_ir: متاسفانه، مدرکی با مشخصات وارد شده یافت نشد. لطفاً ورودی خود را بررسی کرده و دوباره تلاش کنید.

source: Error: Please enter all search fields correctly.
fa_ir: خطا: لطفاً تمام فیلدهای جستجو را به درستی وارد کنید.

source: Edit %s
fa_ir: ویرایش %s

source: FanaByte - Certificate
fa_ir: استعلام مدرک فنابایت

source: Certificate inquiry plugin by FanaByte. Manage and inquire online certificates, warranties, statuses, etc.
fa_ir: افزونه استعلام مدرک فنابایت | سیستم جامع مدیریت و استعلام آنلاین مدارک، گارانتی، وضعیت های مختلف و...

source: FanaByte Academy
fa_ir: آکادمی فنابایت
